podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/FMC_MK10D7.svd.xml
            <register>
               <name>PFB1CR</name>
               <description>Flash Bank 1 Control Register</description>
               <addressOffset>0x8</addressOffset>
               <resetValue>0x3002001F</resetValue>
               <fields>
                  <field>
                     <name>B1SEBE</name>
                     <description>Bank 1 Single Entry Buffer Enable\n
This bit controls whether the single entry page buffer is enabled in response to flash read accesses.\n
Its operation is independent from bank 0&apos;s cache.\n
A high-to-low transition of this bit forces the page buffer to be invalidated</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Buffer is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Buffer is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>B1IPE</name>
                     <description>Bank 1 Instruction Prefetch Enable\n
This bit controls whether prefetches (or speculative accesses) are initiated in response to instruction fetches</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Don&apos;t prefetch instruction fetches</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Prefetches instruction fetches</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>B1DPE</name>
                     <description>Bank 1 Data Prefetch Enable\n
This bit controls whether prefetches (or speculative accesses) are initiated in response to data references</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Don&apos;t prefetch for data references</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Prefetch for data references</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>B1ICE</name>
                     <description>Bank 1 Instruction Cache Enable\n
This bit controls whether instruction fetches are loaded into the cache</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Don&apos;t cache instruction fetches</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Cache instruction fetches</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>B1DCE</name>
                     <description>Bank 1 Data Cache Enable\n
This bit controls whether data references are loaded into the cache</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Don&apos;t cache data references</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Cache data references</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>B1MW</name>
                     <description>Bank 1 Memory Width\n
This field defines the width of the bank memory</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>32 bits</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>64 bits</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>128 bits (if available)</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Reserved</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>B1RWSC</name>
                     <description>Bank 1 Read Wait State Control\n
This field defines the number of wait states required to access the bank flash memory</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0bXXXX</name>
                           <description>Wait state (N+1)</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <cluster>
               <dim>4</dim>
               <dimIncrement>32</dimIncrement>
               <dimIndex>0,1,2,3</dimIndex>
               <name>TAGVDW,@pTAGVDW@i@f</name>
               <addressOffset>0x100</addressOffset>
               <register>
                  <name>S0,TAGVD0</name>
                  <description>Cache Tag Storage\nTag &amp; valid information for Set %s in Way %c</description>
                  <addressOffset>0x0</addressOffset>
                  <fields>
                     <field>
                        <name>valid</name>
                        <description>Valid bit for cache entry</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>Entry is invalid</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>Entry is valid</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>tag</name>
                        <description>Tag for cache entry</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>13</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0bX</name>
                              <description>Tag (address)</description>
                              <isDefault>true</isDefault>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register derivedFrom="S0,TAGVD0"> <name>S1,TAGVD1</name> <description>Cache Tag Storage\nTag &amp; valid information for Set 1 in Way %s</description> <addressOffset>0x4</addressOffset> </register>
               <register derivedFrom="S0,TAGVD0"> <name>S2,TAGVD2</name> <description>Cache Tag Storage\nTag &amp; valid information for Set 2 in Way %s</description> <addressOffset>0x8</addressOffset> </register>
               <register derivedFrom="S0,TAGVD0"> <name>S3,TAGVD3</name> <description>Cache Tag Storage\nTag &amp; valid information for Set 3 in Way %s</description> <addressOffset>0xC</addressOffset> </register>
               <register derivedFrom="S0,TAGVD0"> <name>S4,TAGVD4</name> <description>Cache Tag Storage\nTag &amp; valid information for Set 4 in Way %s</description> <addressOffset>0x10</addressOffset> </register>
               <register derivedFrom="S0,TAGVD0"> <name>S5,TAGVD5</name> <description>Cache Tag Storage\nTag &amp; valid information for Set 5 in Way %s</description> <addressOffset>0x14</addressOffset> </register>
               <register derivedFrom="S0,TAGVD0"> <name>S6,TAGVD6</name> <description>Cache Tag Storage\nTag &amp; valid information for Set 6 in Way %s</description> <addressOffset>0x18</addressOffset> </register>
               <register derivedFrom="S0,TAGVD0"> <name>S7,TAGVD7</name> <description>Cache Tag Storage\nTag &amp; valid information for Set 7 in Way %s</description> <addressOffset>0x1C</addressOffset> </register>
            </cluster>
            <cluster>
               <dim>4</dim>
               <dimIncrement>64</dimIncrement>
               <dimIndex>0,1,2,3</dimIndex>
               <name>DATAW,@pDATAW@i@f</name>
               <addressOffset>0x200</addressOffset>
               <register>
                  <name>S0U,DATAWU</name>
                  <description>Cache Data Storage (upper word)\n
Data storage for Set 0 in Way %s</description>
                  <addressOffset>0x0</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [63:32] of data entry</description>
                        <bitOffset>0</bitOffset>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0bX</name>
                              <description>Cached data</description>
                              <isDefault>true</isDefault>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>S0L,DATAWL</name>
                  <description>Cache Data Storage (lower word)\n
Data storage for Set 0 in Way %s</description>
                  <addressOffset>0x4</addressOffset>
                  <fields>
                     <field>
                        <name>data</name>
                        <description>Bits [31:0] of data entry</description>
                        <bitOffset>0</bitOffset>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0bX</name>
                              <description>Cached data</description>
                              <isDefault>true</isDefault>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register derivedFrom="S0U,DATAWU"> <name>S1U,DATAW1U</name> <description>Cache Data Storage (upper word)\nData storage for Set 1 in Way %s</description> <addressOffset>0x8</addressOffset> </register>
               <register derivedFrom="S0L,DATAWL"> <name>S1L,DATAW1L</name> <description>Cache Data Storage (lower word)\nData storage for Set 1 in Way %s</description> <addressOffset>0xC</addressOffset> </register>
               <register derivedFrom="S0U,DATAWU"> <name>S2U,DATAW2U</name> <description>Cache Data Storage (upper word)\nData storage for Set 2 in Way %s</description> <addressOffset>0x10</addressOffset> </register>
               <register derivedFrom="S0L,DATAWL"> <name>S2L,DATAW2L</name> <description>Cache Data Storage (lower word)\nData storage for Set 2 in Way %s</description> <addressOffset>0x14</addressOffset> </register>
               <register derivedFrom="S0U,DATAWU"> <name>S3U,DATAW3U</name> <description>Cache Data Storage (upper word)\nData storage for Set 3 in Way %s</description> <addressOffset>0x18</addressOffset> </register>
               <register derivedFrom="S0L,DATAWL"> <name>S3L,DATAW3L</name> <description>Cache Data Storage (lower word)\nData storage for Set 3 in Way %s</description> <addressOffset>0x1C</addressOffset> </register>
               <register derivedFrom="S0U,DATAWU"> <name>S4U,DATAW4U</name> <description>Cache Data Storage (upper word)\nData storage for Set 4 in Way %s</description> <addressOffset>0x20</addressOffset> </register>
               <register derivedFrom="S0L,DATAWL"> <name>S4L,DATAW4L</name> <description>Cache Data Storage (lower word)\nData storage for Set 4 in Way %s</description> <addressOffset>0x24</addressOffset> </register>
               <register derivedFrom="S0U,DATAWU"> <name>S5U,DATAW5U</name> <description>Cache Data Storage (upper word)\nData storage for Set 5 in Way %s</description> <addressOffset>0x28</addressOffset> </register>
               <register derivedFrom="S0L,DATAWL"> <name>S5L,DATAW5L</name> <description>Cache Data Storage (lower word)\nData storage for Set 5 in Way %s</description> <addressOffset>0x2C</addressOffset> </register>
               <register derivedFrom="S0U,DATAWU"> <name>S6U,DATAW6U</name> <description>Cache Data Storage (upper word)\nData storage for Set 6 in Way %s</description> <addressOffset>0x30</addressOffset> </register>
               <register derivedFrom="S0L,DATAWL"> <name>S6L,DATAW6L</name> <description>Cache Data Storage (lower word)\nData storage for Set 6 in Way %s</description> <addressOffset>0x34</addressOffset> </register>
               <register derivedFrom="S0U,DATAWU"> <name>S7U,DATAW7U</name> <description>Cache Data Storage (upper word)\nData storage for Set 7 in Way %s</description> <addressOffset>0x38</addressOffset> </register>
               <register derivedFrom="S0L,DATAWL"> <name>S7L,DATAW7L</name> <description>Cache Data Storage (lower word)\nData storage for Set 7 in Way %s</description> <addressOffset>0x3C</addressOffset> </register>
            </cluster>
         </registers>
      </peripheral>
